Реализуй меню Syntax highlight в котором пользователь выбирает подстветку синтаксиса в приложении
Текст сразу подсвечивается и форматируется согласно выбранному формату
По умолчанию это текстовый файл ".txt"
Подстветка должна быть жестко привязана к расширению файла
В диалоговом окне нужно добавить параметры сохранения с расширением файла
Поддерживаемые форматы подсветки: txt, csv, md, xml, json, os
для файлов с расширением os подствека должна быть аналогична подсветке кода на платформе 1С Предприят

Сообщить("Привет");

Приложение не запоминает схему и настройку переноса строк. При каждом запуске сбрасывает перенос и устанавливает темную тему